[
    {
        "title" : "New Bloom Rewards",
        "date" : "2019-02-01",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/nbnybhr_newbloom_blog.png",
        "words" : "In celebration of the Lunar New Year, each victory you earn in normal Dota Matchmaking from February 1 – 11 will grant you progress along the New Bloom rewards line, where you’ll find a host of seasonal delights including gifts, celebrations, and chat wheel sounds. </br></br>Start off by claiming your New Bloom consumables bundle at level one, and bring some festive flair into the lanes with New Bloom Celebrations. Use celebrations in your games safe in the knowledge that you can earn more on the rewards line or by purchasing a fresh bundle with shards.</br></br>As you advance along the line, you can even help your friends get into the spirit of the season by gifting them free spins on the New Bloom rewards wheel. Every spin you and your friends make offers the chance to win an indescribably-rare Nian Courier.</br></br>You’ll receive 200 points for a Normal victory, 100 points for Turbo, and the first win of each day will grant a bonus of 1250 points.</br></br>You’ll be able to use your consumables and chat wheel sounds in your games until March 1, so prepare yourself for battle and start the New Year in style."
    },
    {
        "title" : "A new Ranked Season Update",
        "date" : "2019-01-29",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/mjdtpl_plus_blog.png",
        "words" : "Today’s update unveils a New Ranked Season, a gameplay balance update and new additions to Dota Plus, including four exclusive Dota Plus item sets for Monkey King, Medusa, Enchantress, and Centaur.</br></br>Dota Plus subscribers also have a new set of Seasonal Quests to complete during the new ranked season. Check out the full list on the new Dota Plus home tab, available by clicking your shard total in the top-right corner of your screen.</br></br>To mark the start of a new Ranked Season, all Rank Medals have been reset and players have a chance to recalibrate. In this new season, Rank Medals now have seven star tiers instead of five, offering more rank precision and opportunities to advance. As a bonus, players in each Rank tier will gain access to new emoticons based on their rank.</br></br>Also included for the new ranked season, you can now see your numerical behavior score in your profile and conduct summaries, allowing greater insight into how conduct affects everyone’s enjoyment of the game."
    },
    {
        "title" : "The Chongqing Major",
        "date" : "2019-01-20",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/dpc_major_blog.png",
        "words" : "The Chongqing Major Main Event bracket has been set, and sixteen of the top Dota teams in the world now wage battle over the winner’s share of the $1,000,000 USD and 15,000 DPC points that hang in the balance.</br></br>Fans can tune in each day now through January 27 on SteamTV to catch all of the playoff action. With 4,950 DPC points awaiting the winners less than halfway through the competitive season, it’s anyone’s guess what the Dota Pro Circuit standings might look like in one week’s time. Will an established contender strengthen their grip on the leaderboard, or can a surprising upstart upset the status quo?"
    },
    {
        "title" : "True Sight — The International 2018",
        "date" : "2019-01-14",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/tslwpog_blog_a.jpg",
        "words" : "Join world champions OG and a sold-out crowd as they broadcast live from the Nordisk Film Cinema Palads in Copenhagen, Denmark for the world premiere of True Sight — The International 2018.</br></br>Tune in live on Tuesday, January 15 from 11:00am PST, with hosts Kaci and PyrionFlax, to journey behind the scenes of OG’s epic five-game clash against PSG.LGD, to be followed by a live Q&A session with the audience and the champs themselves.</br></br>Last year, Dota fans around the world watched as history took place in Vancouver. Now it’s time to look back and see exactly how the story unfolded."
    },
    {
        "title" : "Rubick Arcana & Frosthaven Event",
        "date" : "2018-12-19",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/frosthaven_rubarc_blog_jbly.png",
        "words" : "In today’s update, Rubick steals the show, unveiling his own Arcana item before kicking off the events of Frosthaven, a new special game mode available through January 3rd.</br></br>Featuring all-new custom animations and effects—including 115 custom stolen spell effects, dynamic cape colors, and more animations than any other hero in the game—the Magus Cypher Arcana has helped Rubick unlock a deeper mastery in manipulating the arcane arts. No longer content just to mimic the spells of his enemies, Rubick can now alter the very core of the magic used against him, changing it to his liking and casting it back with his own signature style.</br></br>But the new influx of arcane knowledge has left Rubick in want of even more, and his sudden ardor has turned arboreal. In the secluded hamlet of Frosthaven, atop the heart of an ancient power, grows the original Frostivus tree, from which all the world’s holiday presents flow. Rubick, swept up in the zeal of unraveling and reshaping arcane energies, intends to uproot the tree to explore the mysterious font of power beneath it. And only five heroes stand between him and the end of Frostivus forever.</br></br>Head over to the Frosthaven Update page for more information on this chilling special event and a complete rundown of Rubick’s new Magus Cypher Arcana.</br></br>As you take to the lanes looking for a spell to steal, we also hope you’ll enjoy this Arcana’s remastered take on the original voice performance of the late Barry Dennen, who imbued Rubick with a magic that helped the Grand Magus steal our hearts in the first place."
    },    
    {
        "title" : "New Hero — Mars",
        "date" : "2019-03-05",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/ylmfjmarsrevgg_blog.png",
        "words" : "Mars, god of war and first son of heaven, has now joined the battle of the Ancients.</br></br>Abandoning the callous ways of his past and embracing a new identity unburdened by the legacies of his father’s archaic pantheon, Mars has turned over a new spear. Vowing to tear down the remnants of the savage old world to build a new empire, Mars is at last ready to assume the true mantle of leadership over gods and men, a position he now realizes has been wasted for eons by the petty whims of Zeus.</br></br>Learn more about Mars and his abilities here. Or, better yet, launch Dota 2 yourself and get ready to impale your enemies for the glory of the god of war."
    },    
    {
        "title" : "Drow Ranger Remodel",
        "date" : "2019-03-05",
        "image" : "http://cdn.dota2.com/apps/dota2/images/blogfiles/ysnjremodrowbg_blog.png",
        "words" : "Never one to seek the spotlight, Drow Ranger thought to sneak into the lanes without announcing her redesigned model, but the glory of Mars’ arrival has shone a light across the battlefield that not even Traxex can escape."
    }


]